syn_generic
syn_map
syn_opt

write_hdl > syn_out/$toplevel.synthesis.v
write_sdc > syn_out/$toplevel.synthesis.sdc
